artillery-tests/test-64.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 10 
scenarios:
  - flow:
      - loop:
          - post: # resource: resource64
              url: /send
              body: |
                {
                                    "vp": {
                        "holder": "did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8",
                        "verifiableCredential": [
                            "{\"@context\":[\"https://www.w3.org/2018/credentials/v1\"],\"credentialSchema\":{\"id\":\"test-schema.org\",\"type\":\"JsonSchemaValidator2018\"},\"credentialSubject\":{\"attribute0\":\"value0\",\"attribute1\":\"value1\",\"attribute10\":\"value10\",\"attribute11\":\"value11\",\"attribute12\":\"value12\",\"attribute13\":\"value13\",\"attribute14\":\"value14\",\"attribute15\":\"value15\",\"attribute16\":\"value16\",\"attribute17\":\"value17\",\"attribute18\":\"value18\",\"attribute19\":\"value19\",\"attribute2\":\"value2\",\"attribute20\":\"value20\",\"attribute21\":\"value21\",\"attribute22\":\"value22\",\"attribute23\":\"value23\",\"attribute24\":\"value24\",\"attribute25\":\"value25\",\"attribute26\":\"value26\",\"attribute27\":\"value27\",\"attribute28\":\"value28\",\"attribute29\":\"value29\",\"attribute3\":\"value3\",\"attribute30\":\"value30\",\"attribute31\":\"value31\",\"attribute32\":\"value32\",\"attribute33\":\"value33\",\"attribute34\":\"value34\",\"attribute35\":\"value35\",\"attribute36\":\"value36\",\"attribute37\":\"value37\",\"attribute38\":\"value38\",\"attribute39\":\"value39\",\"attribute4\":\"value4\",\"attribute40\":\"value40\",\"attribute41\":\"value41\",\"attribute42\":\"value42\",\"attribute43\":\"value43\",\"attribute44\":\"value44\",\"attribute45\":\"value45\",\"attribute46\":\"value46\",\"attribute47\":\"value47\",\"attribute48\":\"value48\",\"attribute49\":\"value49\",\"attribute5\":\"value5\",\"attribute50\":\"value50\",\"attribute51\":\"value51\",\"attribute52\":\"value52\",\"attribute53\":\"value53\",\"attribute54\":\"value54\",\"attribute55\":\"value55\",\"attribute56\":\"value56\",\"attribute57\":\"value57\",\"attribute58\":\"value58\",\"attribute59\":\"value59\",\"attribute6\":\"value6\",\"attribute60\":\"value60\",\"attribute61\":\"value61\",\"attribute62\":\"value62\",\"attribute63\":\"value63\",\"attribute7\":\"value7\",\"attribute8\":\"value8\",\"attribute9\":\"value9\",\"id\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8\"},\"issuanceDate\":\"2023-12-06T15:30:56.004Z\",\"issuer\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8\",\"proof\":{\"created\":\"2023-12-06T15:30:56.004Z\",\"eip712\":{\"domain\":{\"chainId\":1,\"name\":\"VerifiableCredential\",\"version\":\"1\"},\"primaryType\":\"VerifiableCredential\",\"types\":{\"CredentialSchema\":[{\"name\":\"id\",\"type\":\"string\"},{\"name\":\"type\",\"type\":\"string\"}],\"CredentialSubject\":[{\"name\":\"attribute0\",\"type\":\"string\"},{\"name\":\"attribute1\",\"type\":\"string\"},{\"name\":\"attribute10\",\"type\":\"string\"},{\"name\":\"attribute11\",\"type\":\"string\"},{\"name\":\"attribute12\",\"type\":\"string\"},{\"name\":\"attribute13\",\"type\":\"string\"},{\"name\":\"attribute14\",\"type\":\"string\"},{\"name\":\"attribute15\",\"type\":\"string\"},{\"name\":\"attribute16\",\"type\":\"string\"},{\"name\":\"attribute17\",\"type\":\"string\"},{\"name\":\"attribute18\",\"type\":\"string\"},{\"name\":\"attribute19\",\"type\":\"string\"},{\"name\":\"attribute2\",\"type\":\"string\"},{\"name\":\"attribute20\",\"type\":\"string\"},{\"name\":\"attribute21\",\"type\":\"string\"},{\"name\":\"attribute22\",\"type\":\"string\"},{\"name\":\"attribute23\",\"type\":\"string\"},{\"name\":\"attribute24\",\"type\":\"string\"},{\"name\":\"attribute25\",\"type\":\"string\"},{\"name\":\"attribute26\",\"type\":\"string\"},{\"name\":\"attribute27\",\"type\":\"string\"},{\"name\":\"attribute28\",\"type\":\"string\"},{\"name\":\"attribute29\",\"type\":\"string\"},{\"name\":\"attribute3\",\"type\":\"string\"},{\"name\":\"attribute30\",\"type\":\"string\"},{\"name\":\"attribute31\",\"type\":\"string\"},{\"name\":\"attribute32\",\"type\":\"string\"},{\"name\":\"attribute33\",\"type\":\"string\"},{\"name\":\"attribute34\",\"type\":\"string\"},{\"name\":\"attribute35\",\"type\":\"string\"},{\"name\":\"attribute36\",\"type\":\"string\"},{\"name\":\"attribute37\",\"type\":\"string\"},{\"name\":\"attribute38\",\"type\":\"string\"},{\"name\":\"attribute39\",\"type\":\"string\"},{\"name\":\"attribute4\",\"type\":\"string\"},{\"name\":\"attribute40\",\"type\":\"string\"},{\"name\":\"attribute41\",\"type\":\"string\"},{\"name\":\"attribute42\",\"type\":\"string\"},{\"name\":\"attribute43\",\"type\":\"string\"},{\"name\":\"attribute44\",\"type\":\"string\"},{\"name\":\"attribute45\",\"type\":\"string\"},{\"name\":\"attribute46\",\"type\":\"string\"},{\"name\":\"attribute47\",\"type\":\"string\"},{\"name\":\"attribute48\",\"type\":\"string\"},{\"name\":\"attribute49\",\"type\":\"string\"},{\"name\":\"attribute5\",\"type\":\"string\"},{\"name\":\"attribute50\",\"type\":\"string\"},{\"name\":\"attribute51\",\"type\":\"string\"},{\"name\":\"attribute52\",\"type\":\"string\"},{\"name\":\"attribute53\",\"type\":\"string\"},{\"name\":\"attribute54\",\"type\":\"string\"},{\"name\":\"attribute55\",\"type\":\"string\"},{\"name\":\"attribute56\",\"type\":\"string\"},{\"name\":\"attribute57\",\"type\":\"string\"},{\"name\":\"attribute58\",\"type\":\"string\"},{\"name\":\"attribute59\",\"type\":\"string\"},{\"name\":\"attribute6\",\"type\":\"string\"},{\"name\":\"attribute60\",\"type\":\"string\"},{\"name\":\"attribute61\",\"type\":\"string\"},{\"name\":\"attribute62\",\"type\":\"string\"},{\"name\":\"attribute63\",\"type\":\"string\"},{\"name\":\"attribute7\",\"type\":\"string\"},{\"name\":\"attribute8\",\"type\":\"string\"},{\"name\":\"attribute9\",\"type\":\"string\"},{\"name\":\"id\",\"type\":\"string\"}],\"EIP712Domain\":[{\"name\":\"name\",\"type\":\"string\"},{\"name\":\"version\",\"type\":\"string\"},{\"name\":\"chainId\",\"type\":\"uint256\"}],\"Proof\":[{\"name\":\"created\",\"type\":\"string\"},{\"name\":\"proofPurpose\",\"type\":\"string\"},{\"name\":\"type\",\"type\":\"string\"},{\"name\":\"verificationMethod\",\"type\":\"string\"}],\"VerifiableCredential\":[{\"name\":\"@context\",\"type\":\"string[]\"},{\"name\":\"credentialSchema\",\"type\":\"CredentialSchema\"},{\"name\":\"credentialSubject\",\"type\":\"CredentialSubject\"},{\"name\":\"issuanceDate\",\"type\":\"string\"},{\"name\":\"issuer\",\"type\":\"string\"},{\"name\":\"proof\",\"type\":\"Proof\"},{\"name\":\"type\",\"type\":\"string[]\"}]}},\"proofPurpose\":\"assertionMethod\",\"proofValue\":\"0xdedd52fd7e7bfa5e49caedfdd3332f9de14ff6e5d8fefaae60826e588e0f663c1368c4634207c6a5cde28666e447500b0eb0b8d727ee1187b992ff1d7d9fc27a1c\",\"type\":\"EthereumEip712Signature2021\",\"verificationMethod\":\"did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8#controller\"},\"type\":[\"VerifiableCredential\",\"MascaUserCredential\"]}"
                        ],
                        "type": [
                            "VerifiablePresentation",
                            "Custom"
                        ],
                        "@context": [
                            "https://www.w3.org/2018/credentials/v1"
                        ],
                        "issuanceDate": "2023-12-06T15:31:31.398Z",
                        "proof": {
                            "verificationMethod": "did:ethr:0x1:0x8aadd53dc222d0490f0804a31792a635922a43a8#controller",
                            "created": "2023-12-06T15:31:31.398Z",
                            "proofPurpose": "assertionMethod",
                            "type": "EthereumEip712Signature2021",
                            "proofValue": "0x6f708ecf58ca27d0bffb291a440eacd3a299e7bc654b60cf530e145627f63469012056c514b7d3b1a2b2ae7dd08632d92af0a897e55cf127f5c1bcd38e5668561c",
                            "eip712": {
                                "domain": {
                                    "chainId": 1,
                                    "name": "VerifiablePresentation",
                                    "version": "1"
                                },
                                "types": {
                                    "EIP712Domain": [
                                        {
                                            "name": "name",
                                            "type": "string"
                                        },
                                        {
                                            "name": "version",
                                            "type": "string"
                                        },
                                        {
                                            "name": "chainId",
                                            "type": "uint256"
                                        }
                                    ],
                                    "Proof": [
                                        {
                                            "name": "created",
                                            "type": "string"
                                        },
                                        {
                                            "name": "proofPurpose",
                                            "type": "string"
                                        },
                                        {
                                            "name": "type",
                                            "type": "string"
                                        },
                                        {
                                            "name": "verificationMethod",
                                            "type": "string"
                                        }
                                    ],
                                    "VerifiablePresentation": [
                                        {
                                            "name": "@context",
                                            "type": "string[]"
                                        },
                                        {
                                            "name": "holder",
                                            "type": "string"
                                        },
                                        {
                                            "name": "issuanceDate",
                                            "type": "string"
                                        },
                                        {
                                            "name": "proof",
                                            "type": "Proof"
                                        },
                                        {
                                            "name": "type",
                                            "type": "string[]"
                                        },
                                        {
                                            "name": "verifiableCredential",
                                            "type": "string[]"
                                        }
                                    ]
                                },
                                "primaryType": "VerifiablePresentation"
                            }
                        }
                    },
                  "resource": "resource64"
                }
              headers:
                content-type: application/json
        count: 1